app/Controllers/Admin/Kategori/Read.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $data =
            [
                'title'     => 'Koperasi - Brand List',
                'kategori'     => $this->kategoriModel->findAll(),