app/Controllers/Public/Cart.php

SELECT *
FROM `keranjang`
JOIN `produk` ON `keranjang`.`id_produk` = `produk`.`id_produk`
WHERE `id_akun` = '7'
---
    public function index()
{
    $apiKey = '2d0c536fb8b9498938cb3479dbfb435c'; // Gantilah dengan API Key Anda
    $provinceId = 6.5; // Gantilah dengan ID provinsi yang sesuai

    $url = "https://api.rajaongkir.com/starter/city?province=$provinceId";

    $headers = [
        'key: ' . $apiKey,
    ];

    $ch = curl_init();
    curl_setopt($ch, CURLOPT_URL, $url);
    curl_setopt($ch, CURLOPT_RETURNTRANSFER, 1);
    curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);

    $response = curl_exec($ch);
    curl_close($ch);

    $cities = [];
    if ($response) {
        $cities = json_decode($response, true);
        // Proses data kota dan tampilkan di halaman web
    }

    $data = [
        'keranjang' => $this->keranjangModel
            ->join('produk', 'keranjang.id_produk = produk.id_produk')
            ->where('id_akun', session('id_akun'))
            ->findAll(),
        'cities' => $cities, // Menambahkan data kota ke variabel $data
    ];

SELECT *
FROM `keranjang`
WHERE `id_produk` = '1'
 LIMIT 1
UPDATE `keranjang` SET `qty` = '2'
WHERE `id_produk` = '1'
---
public function update()
{
    $productId = $this->request->getPost('product_id');
    $newQty = $this->request->getPost('new_qty');

    // Cari data keranjang berdasarkan id_produk
    $existingData = $this->keranjangModel
        ->where('id_produk', $productId)
        ->first();

    if ($existingData) {
        // Produk ditemukan dalam keranjang
        $qtybaru = $newQty;

        $this->keranjangModel
            ->where('id_produk', $productId)
            ->set('qty', $qtybaru)
            ->update();