app/Controllers/Public/Dashboard.php

    public function index()
    {
        $data =
        [
        'produk' => $this->produkModel
                ->join('kategori', 'produk.id_kategori = kategori.id_kategori')
                ->findAll(),
            ];
---
SELECT *
FROM `produk`
JOIN `kategori` ON `produk`.`id_kategori` = `kategori`.`id_kategori`