app/Controllers/Public/Dashboard.php

    public function index()
    {
        $data =
        [
        'produk' => $this->produkModel
                ->join('kategori', 'produk.id_kategori = kategori.id_kategori')
                ->findAll(),
        'keranjang' => $this->keranjangModel
                ->join('akun', 'keranjang.id_akun = akun.id_akun')
                ->where('keranjang.id_akun', session('id_akun'))
                ->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `keranjang`
JOIN `akun` ON `keranjang`.`id_akun` = `akun`.`id_akun`
WHERE `keranjang`.`id_akun` IS NULL