app/Controllers/Public/Transaction.php

    public function add()
    {
        $id_akun = $this->request->getPost('id_akun');
        $decodeidakun = base64_decode($id_akun);

        if ($decodeidakun) {
            // Inisialisasi objek Client untuk HTTP request
            $apiKey = '2d0c536fb8b9498938cb3479dbfb435c'; // Gantilah dengan API key RajaOngkir yang Anda miliki
            $curl = new Client();

            // Mendapatkan data provinsi
            $response = $curl->request('GET', 'https://api.rajaongkir.com/starter/province', [
                'headers' => [
                    'key' => $apiKey,
                ],
            ]);
            $provinces = json_decode($response->getBody(), true);

            $data = [
                'akun' => $this->akunModel
                    ->where('id_akun', $decodeidakun)
                    ->First(),
                'keranjang' => $this->keranjangModel
                    ->join('produk', 'keranjang.id_produk = produk.id_produk')
                    ->where('id_akun', $decodeidakun)
                    ->findAll(),
                'alamat' => $this->alamatModel
                    ->join('akun', 'alamat.id_alamat = akun.id_alamat')
                    ->where('akun.id_akun', $decodeidakun)
                    ->first(),
---
SELECT *
FROM `keranjang`
JOIN `produk` ON `keranjang`.`id_produk` = `produk`.`id_produk`
WHERE `id_akun` = '7'
SELECT *
FROM `alamat`
JOIN `akun` ON `alamat`.`id_alamat` = `akun`.`id_alamat`
WHERE `akun`.`id_akun` = '7'
 LIMIT 1

    public function payment($id_transaksi)
    {
        $decodeidtransaksi = base64_decode($id_transaksi);
        $data = [
            'transaksi' => $this->transaksiModel
                ->join('akun', 'transaksi.id_akun = akun.id_akun')
                ->where('transaksi.id_transaksi', $decodeidtransaksi)
                ->first(),
        ];
---
SELECT *
FROM `transaksi`
JOIN `akun` ON `transaksi`.`id_akun` = `akun`.`id_akun`
WHERE `transaksi`.`id_transaksi` = '18'
 LIMIT 1