app/Controllers/Admin/Produk/Create.php

    public function index()
    {
        if (!$this->request->is('post')) {
            $data = [
                'title' => 'Admin - Tambah Produk',
                'kategori' => $this->kategoriModel->findAll(),
            ];
---
SELECT *
FROM `kategori`