app/Controllers/Admin/Produk/Read.php

SELECT *
FROM `produk`
JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`id_kategori`
---
    public function index()
    {
        $produk =  $this->produkModel
        ->join('kategori', 'kategori.id_kategori = produk.id_kategori')
        ->findAll();